Classes/Junior Year/January 2019/Assignment 3/Task 5/TUT4/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       27900;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       28900;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       29900;
    }
    atmosphere
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       30900;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       30900;
    }
)

// ************************************************************************* //
